In [12]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

### Series

In [23]:

obj = Series([4,7,-5,3])
obj.values
obj.index
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
# Create a series with a specified index
obj2 = Series([4,7,-5,3], index = ['d','b','a','c'])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
# Use index values to select values or set of values
obj2['a']
obj2[['c','a']]

c    3
a   -5
dtype: int64

In [13]:
# filter preserves index value link
obj2[obj2>0]
obj2*2
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
# create a series from a dict
sdata = {'Ohio': 35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [16]:
states = ['California','Ohio','Oregon','Texas']
obj4= Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [17]:
# instance methods
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
# automatically aligns differently indexed data in artithmetic operations
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [20]:
obj4.name = 'population'
obj4.index.name='state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [22]:
# Assign new values to index
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

Spreadsheet like data structure, containing an ordered collection of columns

In [25]:
# create a df from a dictionary of equal lengthed lists or arrays
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year': [2000,2001,2002,2001,2002],
       'pop': [1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [26]:
# specify sequence of columns
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [27]:
# rename index with a list, if you declare a column that isnt contained in data, get NaNs

frame2 = DataFrame(data, columns=['year','state','pop','debt'],
                  index=['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [29]:
# retrieve a column dict-like or attribute
frame2['state']
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [38]:
# retrieve rows
frame2.loc['three']
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [42]:
# columns can be modified by assignment
frame2['debt']=16.5
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [43]:
# lengths must match when assigning
val = Series([-1.2,-1.5,-1.7], index=['two','four','five'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [50]:
# assigning a column that doesnt exist
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [52]:
del frame2['eastern']
#frame2 = frame2.drop('eastern',1)
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [53]:
# nested dict of dicts
pop = {'Nevada': {2001:2.4,2002:2.9}, 'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [54]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [55]:
DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [56]:
# Dicts of Series
pdata = {'Ohio':frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [57]:
frame3.index.name = 'year';frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [58]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [59]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index Objects

In [61]:
obj = Series(range(3), index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [62]:
# Index objects are immutable
index[1] = 'd'
# his is so index objects can be safely shared among data structures

TypeError: Index does not support mutable operations

### Essential Functionality

In [66]:
# Reindexing - create a new object w the data conformed to a new index,
obj = Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])
obj2 = obj.reindex(['a','b','c','d','e'])
obj2
# fill_value =0 is an argument to avoid NaN

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [67]:
# interpolation/fillinng for timeseries
obj3 = Series(['blue','purple','yellow'], index=[0,2,4])
obj3.reindex(range(6), method='ffill')
# uses previous value to forward fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [68]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a','c','d'],
                 columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [69]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [71]:
# reindex the columns
states = ['Texas','Utah','California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [72]:
# both at once
frame.reindex(index = ['a','b','c','d'], method ='ffill', columns=states)

ValueError: index must be monotonic increasing or decreasing

In [74]:
frame.loc[['a','b','c','d'],states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [77]:
# dropping entries from an axis
obj = Series(np.arange(5), index = ['a','b','c','d','e'])
new_obj=obj.drop('c')
new_obj
obj.drop(['d','c'])

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [78]:
# dropping in a dataframe
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Ohio','Colorado','Utah','New York'],
                columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [79]:
# drop two rows
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
# drop one columns
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [82]:
# drop two columns
data.drop(['two','four'], axis =1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [83]:
# Indexing, selection and filtering

In [89]:
obj = Series(np.arange(4.), index=['a','b','c','d'])
obj[1]
obj['b']
obj[2:4]
obj[['b','a','d']]
obj[[1,3]]
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [90]:
# slicing with lablesl includes endpoint
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [91]:
# setting
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [104]:
# indexing into a dataframe
data = DataFrame(np.arange(16).reshape((4,4)),
                index =['Ohio','California','Utah','New York'],
                columns=['one','two','three','four'])
data

            one  two  three  four
Ohio          0    1      2     3
California    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [94]:
# index single column
data['two']
# index two columns
data[['three','one']]

            three  one
Ohio            2    0
California      6    4
Utah           10    8
New York       14   12

In [96]:
# Selecting rows
data[:2]
data[data['three']>5]

            one  two  three  four
California    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [97]:
# Indexing with a boolean DataFrame, using scalar comparison
data< 5

              one    two  three   four
Ohio         True   True   True   True
California   True  False  False  False
Utah        False  False  False  False
New York    False  False  False  False

In [98]:
# reassign
data[data<5] = 0
data

            one  two  three  four
Ohio          0    0      0     0
California    0    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [101]:
data.loc['California', ['two','three']]

two      5
three    6
Name: California, dtype: int32

In [107]:

data.loc[['California', 'Utah'],["four","one","two"]]

            four  one  two
California     7    4    5
Utah          11    8    9

In [108]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [109]:
data.loc[:'Utah','two']

Ohio          1
California    5
Utah          9
Name: two, dtype: int32

In [116]:
data.ix[data.three>5,:3]

C:\Users\JohntheGreat\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

            one  two  three
California    4    5      6
Utah          8    9     10
New York     12   13     14

In [ ]:
# Arithmetic and data alignment

In [119]:
s1 = Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1], index = ['a','c','e','f','g'])

In [120]:
s1+s2
# the interal data alignment introduces NA values in the indices that don't overlap

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [122]:
# Data frame alignment
df1 = DataFrame(np.arange(9.).reshape((3,3)), index =['Ohio','Texas','Colorado'],
                columns = list('bde'))
df2 = DataFrame(np.arange(12.).reshape((4,3)), index = ['Utah','Ohio','Texas','Oregon'],
               columns =list('bde'))
df1
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [126]:
df1 + df2

            b     d     e
Colorado  NaN   NaN   NaN
Ohio      3.0   5.0   7.0
Oregon    NaN   NaN   NaN
Texas     9.0  11.0  13.0
Utah      NaN   NaN   NaN

In [132]:
# Fill values
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20).reshape((4,5)), columns=list('abcde'))
df1
#df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [133]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [134]:
# use fill_values
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [135]:
# When reindexing a Series of a DataFrame, you can specify a diff fill value
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [137]:
arr = np.arange(12.).reshape((3,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [140]:
# broadcasting
arr-arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [142]:
# Operations between DataFrame and a Series
frame = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
                 index = ['Utah','Ohio','Texas','Oregon'])
series = frame.iloc[0]

In [143]:
# arithmetiec will match the index of the series on the data frams columns
# broadcasting down the rows
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [144]:
series2 = Series(range(3), index=['b','e','f'])
frame +series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [145]:
# broadcasting over the columns matching on the rows
series3 = frame['d']
frame.sub(series3,axis=0)
# match on rows (axis=0), broadcast across columns

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [ ]:
# Function application and mapping

In [148]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])
f = lambda x: x.max() - x.min()
frame.apply(f) # finds the diff of min max applied to colunmns
frame.apply(f, axis=1) #  lambda function applied to rows

Utah      1.855674
Ohio      2.423537
Texas     2.023736
Oregon    1.165759
dtype: float64

In [149]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])
frame.apply(f)

            b         d         e
min -0.684475 -1.037384 -0.871473
max  1.685477  0.519718  1.339261

In [151]:
format = lambda x: '%.2f' %x
frame.applymap(format)
# Series has a map method for applying an element wise function
frame['e'].map(format)

Utah       0.68
Ohio      -0.87
Texas      1.34
Oregon     0.86
Name: e, dtype: object

In [ ]:
# Sorting and ranking

In [153]:
obj = Series(range(4), index = ['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [156]:
# sort by index on either axis
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'],
                 columns = ['d','a','b','c'])
frame.sort_index()
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [159]:
# sort a series by its values. use order
obj = Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [162]:
obj = Series([4, np.nan, 7, np.nan, -3.2])
obj.sort_values()

4   -3.2
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [165]:
# sort by column in dataframe
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [166]:
# Ranking
obj = Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [ ]:
# Axis indexes with duplicate values

In [168]:
obj = Series(range(5), index = ['a','a','b','b','c'])
obj
obj.index.is_unique

False

In [169]:
obj['a']

a    0
a    1
dtype: int32

In [170]:
df = DataFrame(np.random.randn(4,3), index = ['a','a','b','b'])
df

          0         1         2
a -0.360334 -0.798919  0.292479
a -0.952826  0.611808  0.166800
b -0.753704 -0.526742  1.885705
b  0.285559 -0.353286  1.674430

### Summarizing and Computing Descriptive Statistics

In [173]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
    [np.nan, np.nan], [0.75, -1.3]],
    index=['a', 'b', 'c', 'd'],
    columns=['one', 'two'])
df
# returns column sums
df.sum()
# returns row sums
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [174]:
# NA values are excluded unless the entire slice is NA
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [175]:
# indirect statistics like index value where min/max are
df.idxmax()

one    b
two    d
dtype: object

In [177]:
# accumulations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [178]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [187]:
# correlation and covariance

In [193]:
from pandas_datareader import data, wb
import pandas_datareader as pdr

In [198]:
all_data={}
for ticker in['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker]=pdr.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')
price=DataFrame({tic: data["Adj Close"]
                for tic, data in all_data.iteritems()})
volume = DataFrame({tic:data['Volume']
                   for tic, data in all_data.iteritems()})

RemoteDataError: Unable to read URL: https://query1.finance.yahoo.com/v7/finance/download/MSFT?period1=946706400&period2=1262411999&interval=1d&events=history&crumb=E6N%5Cu002F65GhWm7

In [ ]:
returns = price.pct_change()
returns.tail

In [ ]:
# corr method of Series computes the correlation of the values in 2 series
returns.MSFT.corr(returns.IBM)
returns.MSFT.cov(returns.IBM)

In [ ]:
# corr for DataFrame returns full correlation or covariance matric
returns.corr()
returns.cov()

In [ ]:
# compute pairwise correlations between colums or rows or another series
returns.corrwith(returns.IBM)

In [ ]:
# Unique Values, value counts and membership

In [199]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [200]:

pd.value_counts(obj.values, sort=False)

b    2
a    3
c    3
d    1
dtype: int64

In [202]:
mask = obj.isin(['b','c'])
mask # boolean
obj[mask] # indexed elements

0    c
5    b
6    b
7    c
8    c
dtype: object

### Handling Missing Data

In [204]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data.isnull() # boolean

0    False
1    False
2     True
3    False
dtype: bool

In [205]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
# Filtering out Missing Data

In [208]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data.dropna()
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [209]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
     [NA, NA, NA], [NA, 6.5, 3.]])

In [210]:
# in a DF, will drop any row containing missing value
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [211]:
# only drops rows that are entirely NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [212]:
# dropping coluns, use axis=1
data[4]=NA
data
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [219]:
df = DataFrame(np.random.randn(7,3))
df.iloc[:5,1]=NA;df.iloc[:3,2]=NA
df
df.dropna(thresh=3)

          0         1         2
5  0.045412  1.865233 -0.161901
6 -1.859024  1.648389  0.322731

In [ ]:
# Fill in missing data

In [220]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -1.394784  0.500000       NaN
1  0.367515  0.500000       NaN
2 -1.977857  0.500000       NaN
3 -0.041266  0.500000  0.375806
4 -0.512678  0.500000 -0.291244
5  0.045412  1.865233 -0.161901
6 -1.859024  1.648389  0.322731

In [221]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.394784  0.000000  0.000000
1  0.367515  0.000000  0.000000
2 -1.977857  0.000000  0.000000
3 -0.041266  0.000000  0.375806
4 -0.512678  0.000000 -0.291244
5  0.045412  1.865233 -0.161901
6 -1.859024  1.648389  0.322731

In [223]:
# interpolation methods
df= DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA;df.iloc[4:,2]=NA
df

          0         1         2
0  0.604895  0.794034 -0.350323
1 -1.661948 -0.951966  0.548443
2 -0.650260       NaN -0.326346
3  0.838922       NaN -0.558290
4 -0.899143       NaN       NaN
5 -0.491558       NaN       NaN

In [224]:
df.fillna(method='ffill')

          0         1         2
0  0.604895  0.794034 -0.350323
1 -1.661948 -0.951966  0.548443
2 -0.650260 -0.951966 -0.326346
3  0.838922 -0.951966 -0.558290
4 -0.899143 -0.951966 -0.558290
5 -0.491558 -0.951966 -0.558290

In [227]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### Hierarchical Indexing

In [228]:
data = Series(np.random.randn(10),
    index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
    [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -1.602891
   2    0.686179
   3   -0.501115
b  1   -1.056962
   2   -0.681240
   3   -0.157598
c  1   -1.350830
   2    0.012131
d  2   -1.525280
   3    0.534567
dtype: float64

In [230]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [233]:
data['b']
data['b':'c']
data.loc[['b','d']]

b  1   -1.056962
   2   -0.681240
   3   -0.157598
d  2   -1.525280
   3    0.534567
dtype: float64

In [234]:
data[:,2]

a    0.686179
b   -0.681240
c    0.012131
d   -1.525280
dtype: float64

In [235]:
# rearranged into datafrae using unstack method
data.unstack()

          1         2         3
a -1.602891  0.686179 -0.501115
b -1.056962 -0.681240 -0.157598
c -1.350830  0.012131       NaN
d       NaN -1.525280  0.534567

In [237]:
data.unstack().stack()

a  1   -1.602891
   2    0.686179
   3   -0.501115
b  1   -1.056962
   2   -0.681240
   3   -0.157598
c  1   -1.350830
   2    0.012131
d  2   -1.525280
   3    0.534567
dtype: float64

In [239]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[['Ohio', 'Ohio', 'Colorado'],
    ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [241]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [242]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [243]:
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
names=['state', 'color'])

NameError: name 'MultiIndex' is not defined

In [ ]:
# Reordering and Sorting Levels

In [246]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [247]:
frame.sortlevel(1)

C:\Users\JohntheGreat\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [248]:
frame.swaplevel(0, 1).sortlevel(0)

C:\Users\JohntheGreat\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [249]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [250]:
frame.sum(level='color', axis=1)
# under the hood using groupby

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [251]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [253]:
# use a column as the index
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [254]:
# Oppoisite, the hierarchical index levels are moved into the columns
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

### Other pandas Topics

In [255]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [256]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iget_value(2)

AttributeError: 'Series' object has no attribute 'iget_value'